mfouda/STM32F746G-piano_audio/Piano/Core/Src/main.c
  /*Configure GPIO pin : LCD_INT_Pin */
  GPIO_InitStruct.Pin = LCD_INT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_EVT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(LCD_INT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : ULPI_NXT_Pin */
  GPIO_InitStruct.Pin = ULPI_NXT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(ULPI_NXT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : BP_JOYSTICK_Pin RMII_RXER_Pin */
  GPIO_InitStruct.Pin = BP_JOYSTICK_Pin|RMII_RXER_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_STP_Pin ULPI_DIR_Pin */
  GPIO_InitStruct.Pin = ULPI_STP_Pin|ULPI_DIR_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pin : EXT_RST_Pin */
  GPIO_InitStruct.Pin = EXT_RST_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(EXT_RST_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_CLK_Pin ULPI_D0_Pin */
  GPIO_InitStruct.Pin = ULPI_CLK_Pin|ULPI_D0_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */

/**
  * @brief  Function initializing the Piano interface
  * @param  argument: Not used
  * @retval None
  */
static void Piano_Init(void){
	// Draw param init
	BSP_LCD_Clear(LCD_COLOR_WHITE);
	BSP_LCD_SetFont(&Font12);
	BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
	BSP_LCD_SetBackColor(LCD_COLOR_WHITE);

	// Drawing keys
	for (int i=0;i<8;i++){
		BSP_LCD_DrawRect(white[i], 0, white_w, white_h);
	}
	for (int i=0;i<5;i++){
		BSP_LCD_FillRect(black[i], 0, black_w, black_h);
	}
}


// Interrupt callback function
//void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin){
//	// Touch screen interrupt
//	if(GPIO_Pin == TS_INT_PIN){
//		HAL_GPIO_TogglePin(LED12_GPIO_Port, LED12_Pin);
//
//		//BSP_TS_ITClear();
//	}
//}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{
  /* USER CODE BEGIN 5 */
  /* Infinite loop */
  for(;;)
  {
    osDelay(1);
  }
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_Touch_task */
/**
* @brief Function implementing the Touch thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_Touch_task */
void Touch_task(void const * argument)
{
  /* USER CODE BEGIN Touch_task */
	/* Infinite loop */
	for(;;)
	{
		HAL_GPIO_TogglePin(LED11_GPIO_Port, LED11_Pin);
		osDelay(200);
	}
  /* USER CODE END Touch_task */
}

/* USER CODE BEGIN Header_TS_scan_task */
/**
* @brief Function implementing the TS_scan thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_TS_scan_task */
void TS_scan_task(void const * argument)
{
  /* USER CODE BEGIN TS_scan_task */
	static TS_StateTypeDef  prev_state;
	TS_StateTypeDef TS_State;
	const TickType_t period = 50;
	TickType_t xLastWakeTime;
	uint8_t w_pressed = 0, b_pressed = 0;

	// Initialise the xLastWakeTime variable with the current time.
	xLastWakeTime = xTaskGetTickCount();

	/* Infinite loop */
	for(;;)
	{
		 BSP_TS_GetState(&TS_State);
		 if(TS_State.touchDetected != prev_state.touchDetected){
			 prev_state.touchDetected = TS_State.touchDetected;
			 nb_appuis = TS_State.touchDetected;
			 for (uint8_t i=0; i<TS_State.touchDetected+1; i++){
				 if(TS_State.touchY[i] < black_h){
					 for(uint8_t b=0; b<N_black; b++){
						 if(TS_State.touchX[i] > black[b] && TS_State.touchX[i] < black[b]+black_w){
							 b_pressed |= 1<<b;
							 BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
							 BSP_LCD_FillRect(black[b]+1, 1, black_w-2, black_h-2);
						 } else {
							 BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
							 BSP_LCD_FillRect(black[b]+1, 1, black_w-2, black_h-2);
						 }
					 }
					 for(uint8_t w=0; w<N_white; w++){
						 if(TS_State.touchX[i] > white_up[w] && TS_State.touchX[i] < white_up[w]+white_up_w[w]){
							 w_pressed |= 1<<w;
							 BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
							 BSP_LCD_FillRect(white_up[w]+1, 1, white_up_w[w]-1, black_h-1);
							 BSP_LCD_FillRect(white[w]+1, black_h, white_w-1, white_h);
						 } else {
							 BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
							 BSP_LCD_FillRect(white_up[w]+1, 1, white_up_w[w]-1, black_h-1);
							 BSP_LCD_FillRect(white[w]+1, black_h, white_w-1, white_h);
						 }
					 }
				 } else {
					 for(uint8_t w=0; w<N_white; w++){
						 if(TS_State.touchX[i] > white[w] && TS_State.touchX[i] < white[w]+white_w){
							 w_pressed |= 1<<w;
							 BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
							 BSP_LCD_FillRect(white_up[w]+1, 1, white_up_w[w]-1, black_h-1);
							 BSP_LCD_FillRect(white[w]+1, black_h, white_w-1, white_h);
						 } else {
							 BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
							 BSP_LCD_FillRect(white_up[w]+1, 1, white_up_w[w]-1, black_h-1);
							 BSP_LCD_FillRect(white[w]+1, black_h, white_w-1, white_h);
						 }
					 }
				 }

				 //BSP_LCD_FillCircle(TS_State.touchX[i], TS_State.touchY[i], 4);

				 //xQueueSend(TS_State.touchX[i]);
				 //xQueueSend(TS_State.touchY[i]);

			 }
		 }
		 vTaskDelayUntil(&xLastWakeTime, period);
	}
  /* USER CODE END TS_scan_task */
}

 /**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
